examples/openfoam/example_pimpleFoamYade/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 2;

method          scotch;
strategies
{
  
  optional

}


//simpleCoeffs
//{
//    n               ( 1);
//    delta           0.001;
//}
//
//hierarchicalCoeffs
//{
//    n               (1 1 1);
//    delta           0.001;
//    order           xyz;
//}
//
//manualCoeffs
//{
//    dataFile        "";
//}

distributed     no;

roots           ( );


// ************************************************************************* //
